In [1]:
import pandas as pd
from ctgan.synthesizers.ctgan import CTGANSynthesizer
from sdv.tabular import CTGAN

In [2]:
df = pd.read_csv('/Users/muhammad.khilji/OneDrive - insidemedia.net/Documents/Datasets/titanic.csv')

In [3]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
data = df.copy()

### Synthesis using GAN's

In [5]:
data.columns.values
data.pop("PassengerId")
data.pop("Survived")
data.pop("Pclass")
data.pop("Name")
data.pop("SibSp")
data.pop("Parch")
data.pop("Ticket")
data.pop("Cabin")
data.pop("Embarked")
data.astype('string')
data.head()

      Sex   Age     Fare
0    male  22.0   7.2500
1  female  38.0  71.2833
2  female  26.0   7.9250
3  female  35.0  53.1000
4    male  35.0   8.0500

In [6]:
discrete_columns = ['Sex','Age','Fare']

In [7]:
ctgan = CTGANSynthesizer(epochs=10)
ctgan.fit(data, discrete_columns)

/Users/muhammad.khilji/opt/anaconda3/lib/python3.9/site-packages/pandas/core/frame.py:3678: PerformanceWarning: DataFrame is highly fragmented.  This is usually the result of calling `frame.insert` many times, which has poor performance.  Consider joining all columns at once using pd.concat(axis=1) instead.  To get a de-fragmented frame, use `newframe = frame.copy()`
  self[col] = igetitem(value, i)

In [8]:
# Synthetic copy
samples = ctgan.sample(50)
samples.head()

      Sex   Age      Fare
0    male  38.0   25.5875
1    male   9.0  512.3292
2    male   6.0   77.2875
3  female  32.5    7.8792
4  female  56.0  263.0000

In [9]:
len(samples)

50

### Create new samples

In [10]:
data_aug = df.copy()

In [11]:
data_aug.pop("Survived")
data_aug.pop("Pclass")
data_aug.pop("Name")
data_aug.pop("SibSp")
data_aug.pop("Parch")
data_aug.pop("Ticket")
data_aug.pop("Cabin")
data_aug.pop("Embarked")
data_aug.astype('string')
data_aug.head()

   PassengerId     Sex   Age     Fare
0            1    male  22.0   7.2500
1            2  female  38.0  71.2833
2            3  female  26.0   7.9250
3            4  female  35.0  53.1000
4            5    male  35.0   8.0500

In [12]:
model = CTGAN(primary_key='PassengerId')

In [13]:
model.fit(data_aug)

/Users/muhammad.khilji/opt/anaconda3/lib/python3.9/site-packages/sklearn/mixture/_base.py:265: ConvergenceWarning: Initialization 1 did not converge. Try different init parameters, or increase max_iter, tol or check for degenerate data.
  warnings.warn('Initialization %d did not converge. '
/Users/muhammad.khilji/opt/anaconda3/lib/python3.9/site-packages/ctgan/data_transformer.py:111: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  data[column_name] = data[column_name].to_numpy().flatten()
/Users/muhammad.khilji/opt/anaconda3/lib/python3.9/site-packages/ctgan/data_transformer.py:111: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  data[column_name] = data[column_name].to_numpy().flatten()

In [14]:
augmented_data = model.sample(200)
augmented_data.head()

   PassengerId     Sex    Age     Fare
0            0    male  29.55   0.0000
1            1  female  29.11  34.0960
2            2  female  25.32  36.3943
3            3    male  24.02  19.3450
4            4    male   0.42   0.0000

In [15]:
#augmented_data.to_csv('augmented_data.csv')

200